<a href=https://uplimit.com/course/r-for-data-science>
  <img src=https://imgur.com/6Vkc11w.png />
</a>

|        |                                   |                                   |                                 |                                |
| -------| ----------------------------------| -------------------------------- -| --------------------------------| ------------------------------------------|
| Week 1 | [[01] Doing Data Science](https://colab.research.google.com/drive/1aWpmzS36qVc8hNIaSSSHexlodwwyMJCB)           | [[02] Data Science in Action](https://colab.research.google.com/drive/1aWpmzS36qVc8hNIaSSSHexlodwwyMJCB)       | [[03] Importing Data](https://colab.research.google.com/drive/13kHBX3H1F2yx5yXWJ5iFZh48qjEtpLjU)             | [[04] Visualizing Data: Overview](https://colab.research.google.com/drive/1JSeDt-Gneegd5B2KwWTJF_igYPb-xsIv)          |
|        | [[05] Transforming Data: Overview](https://colab.research.google.com/drive/1IMZJFE8WmwjgdYCddvaO386PljKq_PjC)  | [[06] Transforming Data: Manipulate](https://colab.research.google.com/drive/19ClnAH7d30I9PkD9KuZndPmy5hxk3gdi) |                                 |                                           |
| Week 2 | [[07] Transforming Data: Aggregate](https://colab.research.google.com/drive/1zigvePewKpzKQHx2pjABXU6Ms8QzQXj7) | [[08] Transforming Data: Reshape](https://colab.research.google.com/drive/1Ma9VrM9SrkNEeXTSul0Ca8a7GHAeNLzC)   | [[09] Transforming Data: Combine](https://colab.research.google.com/drive/1JUGm1h4YPmCkre-rVUj5Ql7lBS66_xIs) | [[10] Visualizing Data: Grammar of Graphics](https://colab.research.google.com/drive/1YLE3NPp-TO2KUTohtidjzKMeqJVWxYoT) |
|        | [[11] Data Science in Action Again](https://colab.research.google.com/drive/1eWjVK4oEiXdwdP4sT0nOJlmkCMBkfLpz) |                                   |                                 |                                           |
Books | [Hands on Programming with R](https://rstudio-education.github.io/hopr/index.html) | [R for Data Science](https://r4ds.hadley.nz/) | [Elegant Graphics for Data Analysis](https://ggplot2-book.org/)

> ðŸ“• __BEFORE YOU GET STARTED:__
> 1. Click on **Copy to Drive** to copy notebook to your drive.
> 2. Click on **Share** on the top-right corner (of your copied notebook).
> 3. Update sharing settings to **Anyone with link**
> 4. Delete this cell.

## Reshaping Data

__Reshaping__ data is a fundamental task in data analysis, and the `tidyverse` ecosystem provides several powerful tools for this purpose. The `tidyr` package, which is part of the `tidyverse`, offers a wide range of functions for transforming data between different shapes. In this lesson, we will explore different reshaping operations.

<img src="https://i.imgur.com/gjk7geY.png" />

In [ ]:
# Load packages and common utility functions
library(tidyverse)
url = "https://gist.githubusercontent.com/ramnathv/e71d3ffe88961fc4ef95642053012384/raw/9dda53562d06009912841ab3538d4aeb90e5ee09/_common.R"
download.file(url, basename(url))
source("_common.R")

â”€â”€ Attaching core tidyverse packages â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€ tidyverse 2.0.0 â”€â”€
âœ” dplyr     1.1.3     âœ” readr     2.1.4
âœ” forcats   1.0.0     âœ” stringr   1.5.0
âœ” ggplot2   3.4.4     âœ” tibble    3.2.1
âœ” lubridate 1.9.3     âœ” tidyr     1.3.0
âœ” purrr     1.0.2
â”€â”€ Conflicts â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€ tidyverse_conflicts() â”€â”€
âœ– dplyr::filter() masks stats::filter()
âœ– dplyr::lag()    masks stats::lag()
â„¹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors
Installing package into â€˜/usr/local/lib/R/site-libraryâ€™
(as â€˜libâ€™ is unspecified)

Tracing function "install.packages" in package "utils"

Tracing function "update.packages" in package "utils"

Installing packages into â€˜/usr/local/lib/R/site-libraryâ€™
(as â€˜libâ€™ is unspecified)

Inspecting installed packages...

### Pivot

Pivoting data is a common task in data analysis where data is transformed from one shape to another to facilitate analysis. In general, this involves changing the layout of the data from a __long__ format, where each observation is represented in a separate row, to a __wide__ format, where each observation is represented in a separate column. Alternatively, it may involve changing from a wide format to a long format.

The `tidyr` package in the `tidyverse` provides several functions for pivoting data, including `pivot_wider()` and `pivot_longer()`, which can be used to transform data between wide and long formats.

We will use the `billboard` data that ships with `tidyr` to explore these functions. This dataset is in the __wide__ format and provides the weekly rankings of the top 100 tracks.

In [ ]:
head(billboard)

  artist       track                   date.entered wk1 wk2 wk3 wk4 wk5 wk6 wk7
1 2 Pac        Baby Don't Cry (Keep... 2000-02-26   87  82  72  77  87  94  99
2 2Ge+her      The Hardest Part Of ... 2000-09-02   91  87  92  NA  NA  NA  NA
3 3 Doors Down Kryptonite              2000-04-08   81  70  68  67  66  57  54
4 3 Doors Down Loser                   2000-10-21   76  76  72  69  67  65  55
5 504 Boyz     Wobble Wobble           2000-04-15   57  34  25  17  17  31  36
6 98^0         Give Me Just One Nig... 2000-08-19   51  39  34  26  26  19   2
  â‹¯ wk67 wk68 wk69 wk70 wk71 wk72 wk73 wk74 wk75 wk76
1 â‹¯ NA   NA   NA   NA   NA   NA   NA   NA   NA   NA
2 â‹¯ NA   NA   NA   NA   NA   NA   NA   NA   NA   NA
3 â‹¯ NA   NA   NA   NA   NA   NA   NA   NA   NA   NA
4 â‹¯ NA   NA   NA   NA   NA   NA   NA   NA   NA   NA
5 â‹¯ NA   NA   NA   NA   NA   NA   NA   NA   NA   NA
6 â‹¯ NA   NA   NA   NA   NA   NA   NA   NA   NA   NA

#### `pivot_longer()`: Pivot data from wide to long

Let us start by reshaping this data to the long form. Note that the long form is usually a lot easier to analyze and visualize and is preferred by most data scientists using the `tidyverse`.

In [ ]:
billboard_long <- billboard |>
  pivot_longer(
    cols = starts_with('wk'),
    names_to = 'week',
    values_to = 'rank'
  )

head(billboard_long)

  artist track                   date.entered week rank
1 2 Pac  Baby Don't Cry (Keep... 2000-02-26   wk1  87
2 2 Pac  Baby Don't Cry (Keep... 2000-02-26   wk2  82
3 2 Pac  Baby Don't Cry (Keep... 2000-02-26   wk3  72
4 2 Pac  Baby Don't Cry (Keep... 2000-02-26   wk4  77
5 2 Pac  Baby Don't Cry (Keep... 2000-02-26   wk5  87
6 2 Pac  Baby Don't Cry (Keep... 2000-02-26   wk6  94

`pivot_longer()` takes as input a dataset and a set of arguments that specify the columns to pivot and the new column names to create. In this case, the `cols` argument is set to `starts_with('wk')`, which specifies that any columns that start with the string "wk" should be pivoted. These columns correspond to the weekly ranking of songs on the Billboard charts.

The `names_to` argument specifies the name of the new column that will contain the column names that were pivoted. In this case, it is set to `'week'`, which will create a new column called "week" that contains the week number for each observation.

The `values_to` argument specifies the name of the new column that will contain the values that were pivoted. In this case, it is set to `'rank'`, which will create a new column called "rank" that contains the ranking of each song for each week.

#### `pivot_wider()`: Pivot data from long to wide

Let us reshape `billboard_long` back to the wide format using the `pivot_wider()` function.

In [ ]:
billboard_long |>
  pivot_wider(
    names_from = week,
    values_from = rank
  ) |>
  head()

  artist       track                   date.entered wk1 wk2 wk3 wk4 wk5 wk6 wk7
1 2 Pac        Baby Don't Cry (Keep... 2000-02-26   87  82  72  77  87  94  99
2 2Ge+her      The Hardest Part Of ... 2000-09-02   91  87  92  NA  NA  NA  NA
3 3 Doors Down Kryptonite              2000-04-08   81  70  68  67  66  57  54
4 3 Doors Down Loser                   2000-10-21   76  76  72  69  67  65  55
5 504 Boyz     Wobble Wobble           2000-04-15   57  34  25  17  17  31  36
6 98^0         Give Me Just One Nig... 2000-08-19   51  39  34  26  26  19   2
  â‹¯ wk67 wk68 wk69 wk70 wk71 wk72 wk73 wk74 wk75 wk76
1 â‹¯ NA   NA   NA   NA   NA   NA   NA   NA   NA   NA
2 â‹¯ NA   NA   NA   NA   NA   NA   NA   NA   NA   NA
3 â‹¯ NA   NA   NA   NA   NA   NA   NA   NA   NA   NA
4 â‹¯ NA   NA   NA   NA   NA   NA   NA   NA   NA   NA
5 â‹¯ NA   NA   NA   NA   NA   NA   NA   NA   NA   NA
6 â‹¯ NA   NA   NA   NA   NA   NA   NA   NA   NA   NA

The `pivot_wider()` function takes as input a dataset and a set of arguments that specify the columns to pivot and the new column names to create. In this case, the `names_from` argument is set to `week`, which specifies that the new column names should be based on the values in the "week" column of the `billboard_long` dataset. The `values_from` argument is set to `rank`, which specifies that the values in the "rank" column of the `billboard_long` dataset should be used as the values in the new columns.

__Nesting__ and __Unnesting__ are two useful data transformation techniques that allow us to group and ungroup data in various ways and are supported by the `tidyr` package of the tidyverse. We will use the baby names dataset to illustrate these operations.

In [ ]:
# Read tbl_names from `data/names.csv.gz`
tbl_names <- readr::read_csv(
  file = "https://raw.githubusercontent.com/ramnathv/corise-r-for-ds/main/data/names.csv.gz",
  show_col_types = FALSE
)

### Nest

#### `nest()`: Nest rows into a list-column of data frames

 __Nesting__ involves taking a set of variables and collapsing them into a single column that contains a nested data structure, such as a list or a data frame. This can be useful when we want to perform operations on subsets of our data, or when we have data with a hierarchical structure that we want to preserve.

In [ ]:
# Nest the year and nb_births columns into a list-column named nb_births_by_year
tbl_names_nested <- tbl_names |>
  group_by(sex, name) |>
  nest(nb_births_by_year = c(year, nb_births))

head(tbl_names_nested, 2)

  name sex
1 Mary F
2 Anna F
  nb_births_by_year
1 1880, 1881, 1882, 1883, 1884, 1885, 1886, 1887, 1888, 1889, 1890, 1891, 1892, 1893, 1894, 1895, 1896, 1897, 1898, 1899, 1900, 1901, 1902, 1903, 1904, 1905, 1906, 1907, 1908, 1909, 1910, 1911, 1912, 1913, 1914, 1915, 1916, 1917, 1918, 1919, 1920, 1921, 1922, 1923, 1924, 1925, 1926, 1927, 1928, 1929, 1930, 1931, 1932, 1933, 1934, 1935, 1936, 1937, 1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945, 1946, 1947, 1948, 1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 7065, 6919, 8148, 8012, 9217, 9128, 9889, 9888, 11754, 11648, 12078, 11703, 13172, 12784, 13151, 13447, 13811, 13413, 14406, 13172, 16705, 13136, 14486, 14275, 14961, 16067, 16370, 17580, 18665, 19259, 22848, 24390, 32304, 36642, 45345, 58187, 61438, 64280, 67366, 65837, 70982, 73985, 72177, 71635, 73535, 70587, 67835, 70639, 66873, 63512, 64151, 60295, 59883, 55517, 56934, 55071, 54373, 55643, 56214, 54905, 56212, 58043, 63254, 66178, 62469, 59282, 67471, 71684, 68601, 66868, 65479, 65724, 65624, 64389, 68018, 63175, 61747, 61104, 55852, 54485, 51476, 47682, 43489, 41551, 40984, 34271, 28887, 25316, 21719, 19855, 19202, 16700, 13758, 12312, 11742, 10967, 10319, 10656, 10043, 10563, 11474, 11045, 10854, 9896, 9292, 9242, 8508, 8395, 8511, 8645, 8669, 8761, 8461, 8122, 7752, 7457, 6964, 6649, 6468, 6386, 6212, 5747, 5472, 5026, 4819, 4467, 4097, 3688, 3501, 3167, 2876, 2710, 2581, 2661, 2635, 2635, 2522, 2416, 2355, 2226, 2210, 2080
2 1880, 1881, 1882, 1883, 1884, 1885, 1886, 1887, 1888, 1889, 1890, 1891, 1892, 1893, 1894, 1895, 1896, 1897, 1898, 1899, 1900, 1901, 1902, 1903, 1904, 1905, 1906, 1907, 1908, 1909, 1910, 1911, 1912, 1913, 1914, 1915, 1916, 1917, 1918, 1919, 1920, 1921, 1922, 1923, 1924, 1925, 1926, 1927, 1928, 1929, 1930, 1931, 1932, 1933, 1934, 1935, 1936, 1937, 1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945, 1946, 1947, 1948, 1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976, 1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2604, 2698, 3143, 3306, 3860, 3994, 4283, 4227, 4982, 5062, 5233, 5099, 5542, 5695, 5565, 5950, 5860, 5429, 5773, 5115, 6114, 4923, 5288, 5098, 5330, 5424, 5502, 5575, 5860, 5804, 6436, 6753, 8586, 9687, 11865, 15119, 15228, 15160, 15666, 14498, 14581, 14477, 13408, 12865, 13076, 12251, 11697, 11216, 10575, 9750, 9080, 8429, 7924, 7072, 6681, 6162, 5724, 5449, 5143, 4929, 4718, 4432, 4487, 4232, 3634, 3607, 3999, 4239, 4037, 3897, 3816, 3869, 3713, 3836, 4000, 4090, 4391, 4447, 4660, 4880, 4658, 4672, 4437, 4249, 4292, 3922, 3676, 3727, 3567, 3717, 3798, 3577, 3450, 3503, 3618, 3577, 3589, 3852, 4172, 4669, 5036, 5192, 5270, 5219, 5305, 5883, 5910, 6168, 6441, 6900, 7291, 7119, 6849, 6812, 7526, 8567, 8572, 8341, 8383, 9113, 10603, 10584, 10389, 9452, 9519, 9105, 8603, 7897, 7272, 6811, 6334, 5666, 5622, 5386, 5697, 5139, 4795, 4558, 4182, 3834, 3496, 3044

The column `nb_births_by_year` is a list column, where each element of the list is a data frame with columns `nb_births` and `year`. We can print the first six rows of `nb_births_by_year` for the first row of this nested data frame.

In [ ]:
head(tbl_names_nested$nb_births_by_year[[1]])

  year nb_births
1 1880 7065
2 1881 6919
3 1882 8148
4 1883 8012
5 1884 9217
6 1885 9128

#### `unnest()`: Unnest a list-column of data frames

__Unnesting__, on the other hand, involves taking data that is nested in a column and spreading it out into separate columns. This can be useful when we want to perform analyses on individual components of our data that are currently grouped together.

In [ ]:
tbl_names_nested |>
  unnest(nb_births_by_year) |>
  head()

  name sex year nb_births
1 Mary F   1880 7065
2 Mary F   1881 6919
3 Mary F   1882 8148
4 Mary F   1883 8012
5 Mary F   1884 9217
6 Mary F   1885 9128

#### `unnest_longer()`: Unnest a list-column into rows

There are three other `unnesting` functions supported by the `tidyr` package. To illustrate their usage, let us take the `starwars` data and focus on the `name` and `films` columns.

In [ ]:
starwars_name_films <- starwars |>
  select(name, films)

head(starwars_name_films)

  name
1 Luke Skywalker
2 C-3PO
3 R2-D2
4 Darth Vader
5 Leia Organa
6 Owen Lars
  films
1 The Empire Strikes Back, Revenge of the Sith    , Return of the Jedi     , A New Hope             , The Force Awakens
2 The Empire Strikes Back, Attack of the Clones   , The Phantom Menace     , Revenge of the Sith    , Return of the Jedi     , A New Hope
3 The Empire Strikes Back, Attack of the Clones   , The Phantom Menace     , Revenge of the Sith    , Return of the Jedi     , A New Hope             , The Force Awakens
4 The Empire Strikes Back, Revenge of the Sith    , Return of the Jedi     , A New Hope
5 The Empire Strikes Back, Revenge of the Sith    , Return of the Jedi     , A New Hope             , The Force Awakens
6 Attack of the Clones, Revenge of the Sith , A New Hope

Note how the `films` column is a list of vectors, where each item is a vector of films that included the character.

In [ ]:
starwars_name_films$films[[1]]

[1] "The Empire Strikes Back" "Revenge of the Sith"
[3] "Return of the Jedi"      "A New Hope"
[5] "The Force Awakens"

We can use `unnest_longer()` to unnest this column along the length of the data frame such that every film gets its own row.

In [ ]:
starwars |>
  select(name, films) |>
  unnest_longer(films) |>
  head()

  name           films
1 Luke Skywalker The Empire Strikes Back
2 Luke Skywalker Revenge of the Sith
3 Luke Skywalker Return of the Jedi
4 Luke Skywalker A New Hope
5 Luke Skywalker The Force Awakens
6 C-3PO          The Empire Strikes Back

#### `unnest_wider()`: Unnest a list-column into columns

Alternately, we could also unnest it wider so that each `name` still has only one `row`, but each film gets its own column.

In [ ]:
starwars |>
  select(name, films) |>
  unnest_wider(films, names_sep = "_") |>
  head()

  name           films_1                 films_2
1 Luke Skywalker The Empire Strikes Back Revenge of the Sith
2 C-3PO          The Empire Strikes Back Attack of the Clones
3 R2-D2          The Empire Strikes Back Attack of the Clones
4 Darth Vader    The Empire Strikes Back Revenge of the Sith
5 Leia Organa    The Empire Strikes Back Revenge of the Sith
6 Owen Lars      Attack of the Clones    Revenge of the Sith
  films_3            films_4             films_5            films_6
1 Return of the Jedi A New Hope          The Force Awakens  NA
2 The Phantom Menace Revenge of the Sith Return of the Jedi A New Hope
3 The Phantom Menace Revenge of the Sith Return of the Jedi A New Hope
4 Return of the Jedi A New Hope          NA                 NA
5 Return of the Jedi A New Hope          The Force Awakens  NA
6 A New Hope         NA                  NA                 NA
  films_7
1 NA
2 NA
3 The Force Awakens
4 NA
5 NA
6 NA

Note that the length of `films` for each `name` is not equal and so there are NAs in the data.

#### `unnest_auto()`: Unnest a list-column automatically

Finally, we have the `unnest_auto()` function which automatically uses `unnest_longer()` or `unnest_wider()` based on which one is more appropriate. It displays a message on which function it chose and some reasoning behind it.

In [ ]:
starwars |>
  select(name, films) |>
  unnest_auto(films) |>
  head()

Using `unnest_longer(films, indices_include = FALSE)`; no element has names

  name           films
1 Luke Skywalker The Empire Strikes Back
2 Luke Skywalker Revenge of the Sith
3 Luke Skywalker Return of the Jedi
4 Luke Skywalker A New Hope
5 Luke Skywalker The Force Awakens
6 C-3PO          The Empire Strikes Back

### Expand

#### `expand()`: Expand to include all combinations of values

The `expand()` function can be used to generate all combinations of variables in a data frame. For example, take this data frame of fruits.

In [ ]:
fruits <- tibble(
  type = c("apple", "orange", "apple", "orange", "orange", "orange"),
  year = c(2010, 2010, 2012, 2010, 2011, 2012),
  size = factor(
    c("XS", "S", "M", "S", "S", "M"),
    levels = c("XS", "S", "M", "L")
  ),
  weights = rnorm(6, as.numeric(size) + 2)
)
fruits

  type   year size weights
1 apple  2010 XS   2.178094
2 orange 2010 S    2.986670
3 apple  2012 M    5.570606
4 orange 2010 S    3.996734
5 orange 2011 S    4.091600
6 orange 2012 M    5.376069

We can use `expand()` to generate all combinations of `type` and `size`.

In [ ]:
fruits |>
  expand(type, size)

  type   size
1 apple  XS
2 apple  S
3 apple  M
4 apple  L
5 orange XS
6 orange S
7 orange M
8 orange L

#### `complete()`: Complete with missing combinations

The `complete()` function extends what the `expand()` function does and also adds the remaining columns of the data, and fills them with NAs where the values are missing.

In [ ]:
fruits |>
  complete(type, size)

   type   size year weights
1  apple  XS   2010 2.178094
2  apple  S      NA       NA
3  apple  M    2012 5.570606
4  apple  L      NA       NA
5  orange XS     NA       NA
6  orange S    2010 2.986670
7  orange S    2010 3.996734
8  orange S    2011 4.091600
9  orange M    2012 5.376069
10 orange L      NA       NA

#### `separate_rows()`: Separate a collapsed column into multiple rows

Let us go back to the `starwars` data and look at the `skin_color` column. Note values like `white, blue` which are essentially the result of collapsing the vector `c("white", "blue")` into a single comma separated string.

In [ ]:
starwars |>
  filter(str_detect(skin_color, ",")) |>
  select(name, skin_color)

   name                  skin_color
1  R2-D2                 white, blue
2  R5-D4                 white, red
3  Jabba Desilijic Tiure green-tan, brown
4  Watto                 blue, grey
5  Sebulba               grey, red
6  Dud Bolt              blue, grey
7  Gasgano               white, blue
8  Ben Quadinaros        grey, green, yellow
9  Zam Wesell            fair, green, yellow
10 Ratts Tyerell         grey, blue
11 R4-P17                silver, red
12 Wat Tambor            green, grey
13 Shaak Ti              red, blue, white
14 Grievous              brown, white

We can use the `separate_rows()` function to separate this collapsed column into multiple rows.

In [ ]:
starwars |>
  select(name, skin_color) |>
  separate_rows(skin_color) |>
  head()

  name           skin_color
1 Luke Skywalker fair
2 C-3PO          gold
3 R2-D2          white
4 R2-D2          blue
5 Darth Vader    white
6 Leia Organa    light